jmeter/report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 110,
    "errorCount" : 60,
    "errorPct" : 54.545456,
    "meanResTime" : 57.40909090909092,
    "medianResTime" : 11.0,
    "minResTime" : 4.0,
    "maxResTime" : 137.0,
    "pct1ResTime" : 123.9,
    "pct2ResTime" : 127.0,
    "pct3ResTime" : 136.78,
    "throughput" : 11.672325976230901,
    "receivedKBytesPerSec" : 5.92693853459253,
    "sentKBytesPerSec" : 2.4379866232491514
  },
  "Register User" : {
    "transaction" : "Register User",
    "sampleCount" : 10,
    "errorCount" : 10,
    "errorPct" : 100.0,
    "meanResTime" : 15.7,
    "medianResTime" : 11.0,
    "minResTime" : 9.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 57.80000000000002,
    "pct2ResTime" : 63.0,
    "pct3ResTime" : 63.0,
    "throughput" : 1.1337868480725624,
    "receivedKBytesPerSec" : 0.40202930130385484,
    "sentKBytesPerSec" : 0.3401360544217687
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 117.52000000000001,
    "medianResTime" : 115.0,
    "minResTime" : 109.0,
    "maxResTime" : 137.0,
    "pct1ResTime" : 127.0,
    "pct2ResTime" : 133.35,
    "pct3ResTime" : 137.0,
    "throughput" : 5.347593582887701,
    "receivedKBytesPerSec" : 3.265478776737968,
    "sentKBytesPerSec" : 1.2799757687165776
  },
  "Get Me Request" : {
    "transaction" : "Get Me Request",
    "sampleCount" : 50,
    "errorCount" : 50,
    "errorPct" : 100.0,
    "meanResTime" : 5.639999999999999,
    "medianResTime" : 5.0,
    "minResTime" : 4.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.449999999999996,
    "pct3ResTime" : 9.0,
    "throughput" : 5.410084397316598,
    "receivedKBytesPerSec" : 2.3563453527375025,
    "sentKBytesPerSec" : 0.8664588292577363
  }
}