jmeter/report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 110,
    "errorCount" : 10,
    "errorPct" : 9.090909,
    "meanResTime" : 33.41818181818183,
    "medianResTime" : 8.0,
    "minResTime" : 3.0,
    "maxResTime" : 97.0,
    "pct1ResTime" : 67.0,
    "pct2ResTime" : 74.0,
    "pct3ResTime" : 95.13000000000001,
    "throughput" : 11.82033096926714,
    "receivedKBytesPerSec" : 6.013635356221793,
    "sentKBytesPerSec" : 3.5188151461422743
  },
  "Register User" : {
    "transaction" : "Register User",
    "sampleCount" : 10,
    "errorCount" : 10,
    "errorPct" : 100.0,
    "meanResTime" : 9.700000000000001,
    "medianResTime" : 8.0,
    "minResTime" : 5.0,
    "maxResTime" : 22.0,
    "pct1ResTime" : 21.200000000000003,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 22.0,
    "throughput" : 1.1183180496533214,
    "receivedKBytesPerSec" : 0.396544222489376,
    "sentKBytesPerSec" : 0.33549541489599644
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 67.58000000000001,
    "medianResTime" : 65.5,
    "minResTime" : 64.0,
    "maxResTime" : 97.0,
    "pct1ResTime" : 74.0,
    "pct2ResTime" : 77.79999999999998,
    "pct3ResTime" : 97.0,
    "throughput" : 5.388511693070374,
    "receivedKBytesPerSec" : 3.290465196950102,
    "sentKBytesPerSec" : 1.2897697421597154
  },
  "Get Me Request" : {
    "transaction" : "Get Me Request",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.0,
    "medianResTime" : 4.0,
    "minResTime" : 3.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 7.0,
    "throughput" : 5.6657223796034,
    "receivedKBytesPerSec" : 2.4798601274787537,
    "sentKBytesPerSec" : 2.0145405453257794
  }
}